ext_ОбщиеДоработки/ka2_2024.ОбщиеДоработкиРВК/src/Documents/СчетФактураВыданный/СчетФактураВыданный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9eab2298-ca44-4cc2-a529-95431e0e3800">
  <name>СчетФактураВыданный</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="fd65fde8-b84e-417c-a0f6-6d991416b565">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

ext_ОбщиеДоработки/ka2_2024.ОбщиеДоработкиРВК/src/Documents/КорректировкаРеализации/КорректировкаРеализации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="69ec59c6-f56d-4522-9097-9fe67516b81d">
  <name>КорректировкаРеализации</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="059a97a9-0185-4d15-a42a-847216f23458">
    <name>ВидыЗапасовСписание</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="38c6df42-3e4e-4726-8b28-d6134b1d3dfb">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fe2b68eb-0bf6-418d-8949-89e3e255ac4e">
      <name>АналитикаУчетаНоменклатуры</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2a1790a7-7022-4f40-a8e9-34a433cd7264">
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="200c8c77-18f6-4e82-9a24-c727e0524428">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="aeee49fc-ade6-4a2c-953d-4b2e370ea241">
    <name>ВидыЗапасовОприходование</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f1f99650-fe83-41a6-bbc8-8246a47591c9">
      <name>АналитикаУчетаНоменклатуры</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="041bb578-00b1-430c-be65-aa56729eb821">
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="40efde9e-43d4-4ceb-bb19-dd17aaa4bbf4">
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fbc167ac-aad3-4619-a2ac-b9829b152e06">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

ext_ОбщиеДоработки/ka2_2024.ОбщиеДоработкиРВК/src/Documents/СчетФактураВыданный/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

&Перед("ЗаполнитьТаблицуТоваров")
Процедура рвк_ЗаполнитьТаблицуТоваров(РезультатЗаполнения) Экспорт

	Если Не РезультатЗаполнения.Корректировочный Тогда
		Возврат;
	КонецЕсли;

	ТаблицыТоваровДокументаОснование = ТаблицыТоваровДокументаОснование();
	Для Каждого СтрокаТовары Из РезультатЗаполнения.Товары Цикл
		ВидОперации = ?(ЗначениеЗаполнено(СтрокаТовары.КоличествоУвеличение), "Списание", "Оприходование");
		Отбор = Новый Структура;
		Отбор.Вставить("ВидОперации", ВидОперации);
		Отбор.Вставить("Номенклатура", СтрокаТовары.Номенклатура);
		СтрокиДокументаОснования = ТаблицыТоваровДокументаОснование.НайтиСтроки(Отбор);
		Если Не ЗначениеЗаполнено(СтрокиДокументаОснования) Тогда
			Продолжить;
		КонецЕсли;
		СтрокаДокументаОснования = СтрокиДокументаОснования[0];
		Если ВидОперации = "Списание" И СтрокаТовары.КоличествоУвеличение > СтрокаДокументаОснования.Количество Тогда
			СтрокаТовары.КоличествоУвеличение = СтрокаДокументаОснования.Количество;
			СтрокаТовары.СуммаУвеличение = СтрокаТовары.СуммаУвеличение / 2;
			СтрокаТовары.СуммаНДСУвеличение = СтрокаТовары.СуммаНДСУвеличение / 2;
			
			СтрокаТовары.Количество = СтрокаТовары.Количество + СтрокаДокументаОснования.Количество; 
			СтрокаТовары.СуммаНДС = СтрокаТовары.СуммаНДС + СтрокаТовары.СуммаНДСУвеличение;
			СтрокаТовары.Сумма = СтрокаТовары.Сумма + СтрокаТовары.СуммаУвеличение;
		ИначеЕсли ВидОперации = "Оприходование" Тогда
			СтрокаТовары.КоличествоУменьшение = СтрокаДокументаОснования.Количество;
			СтрокаТовары.СуммаУменьшение = СтрокаТовары.СуммаУменьшение / 2;
			СтрокаТовары.СуммаНДСУменьшение = СтрокаТовары.СуммаНДСУменьшение / 2;
			
			СтрокаТовары.Количество = СтрокаТовары.Количество - СтрокаДокументаОснования.Количество;
			СтрокаТовары.СуммаНДС = СтрокаТовары.СуммаНДС - СтрокаТовары.СуммаНДСУменьшение;
			СтрокаТовары.Сумма = СтрокаТовары.Сумма - СтрокаТовары.СуммаУменьшение;
		КонецЕсли;
	КонецЦикла;

	//TODO: Вставить содержимое обработчика
КонецПроцедуры

Функция ТаблицыТоваровДокументаОснование()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КорректировкаРеализацииВидыЗапасовОприходование.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	СУММА(КорректировкаРеализацииВидыЗапасовОприходование.Количество) КАК Количество,
		|	СУММА(КорректировкаРеализацииВидыЗапасовОприходование.СуммаСНДС) КАК СуммаСНДС,
		|	СУММА(КорректировкаРеализацииВидыЗапасовОприходование.СуммаНДС) КАК СуммаНДС,
		|	""Оприходование"" КАК ВидОперации
		|ИЗ
		|	Документ.КорректировкаРеализации.ВидыЗапасовОприходование КАК КорректировкаРеализацииВидыЗапасовОприходование
		|ГДЕ
		|	КорректировкаРеализацииВидыЗапасовОприходование.Ссылка = &ДокументОснование
		|СГРУППИРОВАТЬ ПО
		|	КорректировкаРеализацииВидыЗапасовОприходование.АналитикаУчетаНоменклатуры.Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КорректировкаРеализацииВидыЗапасовСписание.АналитикаУчетаНоменклатуры.Номенклатура,
		|	СУММА(КорректировкаРеализацииВидыЗапасовСписание.Количество),
		|	СУММА(КорректировкаРеализацииВидыЗапасовСписание.СуммаСНДС),
		|	СУММА(КорректировкаРеализацииВидыЗапасовСписание.СуммаНДС),
		|	""Списание""
		|ИЗ
		|	Документ.КорректировкаРеализации.ВидыЗапасовСписание КАК КорректировкаРеализацииВидыЗапасовСписание
		|ГДЕ
		|	КорректировкаРеализацииВидыЗапасовСписание.Ссылка = &ДокументОснование
		|СГРУППИРОВАТЬ ПО
		|	КорректировкаРеализацииВидыЗапасовСписание.АналитикаУчетаНоменклатуры.Номенклатура";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
